/**
 * 
 */
package com.agiliumlabs.smev.ws.model;

/**
 * @author roman
 *
 */
public enum TypeCode {
	
    /**
     * Взаимодеи\u0306ствие в рамках оказания государственных
     * 						услуг 
     * 
     */
    GSRV,

    /**
     * Взаимодеи\u0306ствие в рамках исполнения
     * 						государственных функций
     * 					
     * 
     */
    GFNC,

    /**
     * 
     * 						Взаимодеи\u0306ствие в иных целях, предусмотренных законодательством России\u0306скои\u0306
     * 						Федерации
     * 					
     * 
     */
    OTHR;

}
